In [53]:
import pandas as pd
from sklearn.model_selection import train_test_split
import numpy as np
import torch

In [117]:
df_train=pd.read_csv('train.csv')
df_train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [118]:
df_train.sample(5)#случайные 5

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
191,192,0,2,"Carbines, Mr. William",male,19.0,0,0,28424,13.0000,NaN,S
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN
727,728,1,3,"Mannion, Miss. Margareth",female,NaN,0,0,36866,7.7375,NaN,Q
450,451,0,2,"West, Mr. Edwy Arthur",male,36.0,1,2,C.A. 34651,27.7500,NaN,S
470,471,0,3,"Keefe, Mr. Arthur",male,NaN,0,0,323592,7.2500,NaN,S

In [119]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [120]:
df_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [121]:
# в частности, избавимся от столбца Cabin 
df_train.drop(labels = 'Cabin', axis = 1, inplace = True)
# заполним пропуски в столбце Age медианным значением
df_train.Age.fillna(df_train.Age.median(), inplace = True)
# два пропущенных значения в столбце Embarked заполним портом Southhampton
df_train.Embarked.fillna('S', inplace = True)
# проверим результат (найдем общее количество пропусков сначала по столбцам, затем по строкам)
df_train.isnull().sum().sum()

0

In [122]:
t=df_train.Survived.unique()
print(t)

[0 1]

In [123]:
t=df_train.Survived.value_counts()
print(t)

0    549
1    342
Name: Survived, dtype: int64

In [130]:
titanic=df_train.copy()
titanic.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
237,238,1,2,"Collyer, Miss. Marjorie ""Lottie""",female,8.0,0,2,C.A. 31921,26.2500,S
419,420,0,3,"Van Impe, Miss. Catharina",female,10.0,0,2,345773,24.1500,S
159,160,0,3,"Sage, Master. Thomas Henry",male,28.0,8,2,CA. 2343,69.5500,S
648,649,0,3,"Willey, Mr. Edward",male,28.0,0,0,S.O./P.P. 751,7.5500,S
625,626,0,1,"Sutton, Mr. Frederick",male,61.0,0,0,36963,32.3208,S

In [158]:
from pandasql import sqldf
print(
    (titanic['PassengerId'][(titanic['Survived']==1)&(titanic['Pclass']==2)]).head(1))
t=sqldf('select PassengerId from titanic where Survived=1 and Pclass=2 limit 1 ',locals())
print(type(t))

9    10
Name: PassengerId, dtype: int64
<class 'pandas.core.frame.DataFrame'>

In [144]:
meanvalue=titanic['Age'].mean()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64
29.36158249158249

In [171]:
tit=titanic.query('Name.str.contains("Miss")', engine='python')['Name'].head(10)
print(tit)

2                   Heikkinen, Miss. Laina
10         Sandstrom, Miss. Marguerite Rut
11                Bonnell, Miss. Elizabeth
14    Vestrom, Miss. Hulda Amanda Adolfina
22             McGowan, Miss. Anna "Annie"
24           Palsson, Miss. Torborg Danira
28           O'Dwyer, Miss. Ellen "Nellie"
32                Glynn, Miss. Mary Agatha
38      Vander Planke, Miss. Augusta Maria
39             Nicola-Yarred, Miss. Jamila
Name: Name, dtype: object